{
    "virtue": {
        "result": {
            "libraryId": "",
            "collectionId": "",
            "id": "",
            "meditation": false,
            "perfection": false,
            "jumble": false,
            "scramble": false,
            "ambience": "",
            "success": false,
            "completed": false,
            "value": "",
            "value_zonal": "",
            "value_length": 0,
            "value_length_percentage": 0,
            "datetime_start_epoch": 0,
            "datetime_end_epoch": 0,
            "datetime_start_iso": "",
            "datetime_end_iso": "",
            "datetime_duration_ms": 0,
            "datetime_stopwatch": "",
            "rate_hit_per_min": "",
            "shot_num_new": 0,
            "hit_indices": [],
            "hit_num": 0,
            "hit_num_new": 0,
            "hit_num_percentage": 0,
            "miss_indices": [],
            "miss_num": 0,
            "miss_num_new": 0,
            "miss_num_percentage": 0,
            "amend_num_new": 0,
            "other_num_new": 0,
            "shot_num_total": 0,
            "hit_num_total": 0,
            "hit_num_total_percentage": 0,
            "miss_num_total": 0,
            "miss_num_total_percentage": 0,
            "amend_num_total": 0,
            "amend_num_total_percentage": 0,
            "other_num_total": 0,
            "other_num_total_percentage": 0,
            "datetime_duration_ms_global": 992537,
            "datetime_stopwatch_global": "16:32",
            "rate_hit_per_min_global": 352.61,
            "shot_num_global": 6305,
            "hit_num_global": 5831,
            "hit_num_global_percentage": 92.48,
            "miss_num_global": 474,
            "miss_num_global_percentage": 7.52,
            "amend_num_global": 0,
            "amend_num_global_percentage": 0,
            "other_num_global": 0,
            "other_num_global_percentage": 0
        }
    },
    "virtues": {
        "count": 2,
        "values": [
            {
                "result": {
                    "libraryId": "Custom library",
                    "collectionId": "https://leojonathanoh.github.io/touchtypie-library/collections/bible-YLT-proverbs.txt",
                    "id": "https://leojonathanoh.github.io/bible_databases/txt/YLT/chapters/Proverbs%201.txt",
                    "meditation": true,
                    "perfection": true,
                    "jumble": false,
                    "scramble": false,
                    "ambience": "stars",
                    "success": true,
                    "completed": true,
                    "value": "[1:1] Proverbs of Solomon, son of David, king of Israel:\n[1:2] For knowing wisdom and instruction, For understanding sayings of intelligence,\n[1:3] For receiving the instruction of wisdom, Righteousness, judgment, and uprightness,\n[1:4] For giving to simple ones -- prudence, To a youth -- knowledge and discretion.\n[1:5] (The wise doth hear and increaseth learning, And the intelligent doth obtain counsels.)\n[1:6] For understanding a proverb and its sweetness, Words of the wise and their acute sayings.\n[1:7] Fear of Jehovah `is' a beginning of knowledge, Wisdom and instruction fools have despised!\n[1:8] Hear, my son, the instruction of thy father, And leave not the law of thy mother,\n[1:9] For a graceful wreath `are' they to thy head, And chains to thy neck.\n[1:10] My son, if sinners entice thee be not willing.\n[1:11] If they say, `Come with us, we lay wait for blood, We watch secretly for the innocent without cause,\n[1:12] We swallow them as Sheol -- alive, And whole -- as those going down `to' the pit,\n[1:13] Every precious substance we find, We fill our houses `with' spoil,\n[1:14] Thy lot thou dost cast among us, One purse is -- to all of us.'\n[1:15] My son! go not in the way with them, Withhold thy foot from their path,\n[1:16] For their feet to evil do run, And they haste to shed blood.\n[1:17] Surely in vain is the net spread out before the eyes of any bird.\n[1:18] And they for their own blood lay wait, They watch secretly for their own lives.\n[1:19] So `are' the paths of every gainer of dishonest gain, The life of its owners it taketh.\n[1:20] Wisdom in an out-place crieth aloud, In broad places she giveth forth her voice,\n[1:21] At the head of the multitudes she calleth, In the openings of the gates, In the city her sayings she saith:\n[1:22] `Till when, ye simple, do ye love simplicity? And have scorners their scorning desired? And do fools hate knowledge?\n[1:23] Turn back at my reproof, lo, I pour forth to you my spirit, I make known my words with you.\n[1:24] Because I have called, and ye refuse, I stretched out my hand, and none is attending,\n[1:25] And ye slight all my counsel, And my reproof ye have not desired.\n[1:26] I also in your calamity do laugh, I deride when your fear cometh,\n[1:27] When your fear cometh as destruction, And your calamity as a hurricane doth come, When on you come adversity and distress.\n[1:28] Then they call me, and I do not answer, They seek me earnestly, and find me not.\n[1:29] Because that they have hated knowledge, And the fear of Jehovah have not chosen.\n[1:30] They have not consented to my counsel, They have despised all my reproof,\n[1:31] And they eat of the fruit of their way, And from their own counsels they are filled.\n[1:32] For the turning of the simple slayeth them, And the security of the foolish destroyeth them.\n[1:33] And whoso is hearkening to me dwelleth confidently, And `is' quiet from fear of evil!'",
                    "value_zonal": "<redacted>",
                    "value_length": 2902,
                    "value_length_percentage": 100,
                    "datetime_start_epoch": 1625365941263,
                    "datetime_end_epoch": 1625366436705,
                    "datetime_start_iso": "2021-07-04T02:32:21.263Z",
                    "datetime_end_iso": "2021-07-04T02:40:36.705Z",
                    "datetime_duration_ms": 495442,
                    "datetime_stopwatch": "08:15",
                    "rate_hit_per_min": 351.56,
                    "shot_num_new": 1,
                    "hit_indices": [
                        2901
                    ],
                    "hit_num": 1,
                    "hit_num_new": 1,
                    "hit_num_percentage": 0.03,
                    "miss_indices": [],
                    "miss_num": 0,
                    "miss_num_new": 0,
                    "miss_num_percentage": 0,
                    "amend_num_new": 0,
                    "other_num_new": 0,
                    "shot_num_total": 3117,
                    "hit_num_total": 2903,
                    "hit_num_total_percentage": 93.13,
                    "miss_num_total": 215,
                    "miss_num_total_percentage": 6.9,
                    "amend_num_total": 0,
                    "amend_num_total_percentage": 0,
                    "other_num_total": 0,
                    "other_num_total_percentage": 0
                }
            },
            {
                "result": {
                    "libraryId": "Custom library",
                    "collectionId": "https://leojonathanoh.github.io/touchtypie-library/collections/bible-YLT-proverbs.txt",
                    "id": "https://leojonathanoh.github.io/bible_databases/txt/YLT/chapters/Proverbs%2021.txt",
                    "meditation": true,
                    "perfection": true,
                    "jumble": false,
                    "scramble": false,
                    "ambience": "stars",
                    "success": true,
                    "completed": true,
                    "value": "[21:1] Rivulets of waters `is' the heart of a king in the hand of Jehovah, Wherever He pleaseth He inclineth it.\n[21:2] Every way of a man `is' right in his own eyes, And Jehovah is pondering hearts.\n[21:3] To do righteousness and judgment, Is chosen of Jehovah rather than sacrifice.\n[21:4] Loftiness of eyes, and breadth of heart, Tillage of the wicked `is' sin.\n[21:5] The purposes of the diligent `are' only to advantage, And of every hasty one, only to want.\n[21:6] The making of treasures by a lying tongue, `Is' a vanity driven away of those seeking death.\n[21:7] The spoil of the wicked catcheth them, Because they have refused to do judgment.\n[21:8] Froward `is' the way of a man who is vile, And the pure -- upright `is' his work.\n[21:9] Better to sit on a corner of the roof, Than `with' a woman of contentions and a house of company.\n[21:10] The soul of the wicked hath desired evil, Not gracious in his eyes is his neighbour.\n[21:11] When the scorner is punished, the simple becometh wise, And in giving understanding to the wise He receiveth knowledge.\n[21:12] The Righteous One is acting wisely Towards the house of the wicked, He is overthrowing the wicked for wickedness.\n[21:13] Whoso is shutting his ear from the cry of the poor, He also doth cry, and is not answered.\n[21:14] A gift in secret pacifieth anger, And a bribe in the bosom strong fury.\n[21:15] To do justice `is' joy to the righteous, But ruin to workers of iniquity.\n[21:16] A man who is wandering from the way of understanding, In an assembly of Rephaim resteth.\n[21:17] Whoso `is' loving mirth `is' a poor man, Whoso is loving wine and oil maketh no wealth.\n[21:18] The wicked `is' an atonement for the righteous, And for the upright the treacherous dealer.\n[21:19] Better to dwell in a wilderness land, Than `with' a woman of contentions and anger.\n[21:20] A treasure to be desired, and oil, `Is' in the habitation of the wise, And a foolish man swalloweth it up.\n[21:21] Whoso is pursuing righteousness and kindness, Findeth life, righteousness, and honour.\n[21:22] A city of the mighty hath the wise gone up, And bringeth down the strength of its confidence.\n[21:23] Whoso is keeping his mouth and his tongue, Is keeping from adversities his soul.\n[21:24] Proud, haughty, scorner `is' his name, Who is working in the wrath of pride.\n[21:25] The desire of the slothful slayeth him, For his hands have refused to work.\n[21:26] All the day desiring he hath desired, And the righteous giveth and withholdeth not.\n[21:27] The sacrifice of the wicked `is' abomination, Much more when in wickedness he bringeth it.\n[21:28] A false witness doth perish, And an attentive man for ever speaketh.\n[21:29] A wicked man hath hardened by his face, And the upright -- he prepareth his way.\n[21:30] There is no wisdom, nor understanding, Nor counsel, over-against Jehovah.\n[21:31] A horse is prepared for a day of battle, And the deliverance `is' of Jehovah!",
                    "value_zonal": "<redacted>",
                    "value_length": 2929,
                    "value_length_percentage": 100,
                    "datetime_start_epoch": 1625366442821,
                    "datetime_end_epoch": 1625366939916,
                    "datetime_start_iso": "2021-07-04T02:40:42.821Z",
                    "datetime_end_iso": "2021-07-04T02:48:59.916Z",
                    "datetime_duration_ms": 497095,
                    "datetime_stopwatch": "08:16",
                    "rate_hit_per_min": 353.65,
                    "shot_num_new": 1,
                    "hit_indices": [
                        2928
                    ],
                    "hit_num": 1,
                    "hit_num_new": 1,
                    "hit_num_percentage": 0.03,
                    "miss_indices": [],
                    "miss_num": 0,
                    "miss_num_new": 0,
                    "miss_num_percentage": 0,
                    "amend_num_new": 0,
                    "other_num_new": 0,
                    "shot_num_total": 3188,
                    "hit_num_total": 2930,
                    "hit_num_total_percentage": 91.91,
                    "miss_num_total": 259,
                    "miss_num_total_percentage": 8.12,
                    "amend_num_total": 0,
                    "amend_num_total_percentage": 0,
                    "other_num_total": 0,
                    "other_num_total_percentage": 0
                }
            }
        ]
    }
}